AUTHOR_MESSAGES = {
    'check_author': 'Верный пароль.\nВы находитесь в меню изменения данных БД. Для '
                    'создания новой карточки нужно будет последовательно '
                    'ввести:\nНазвание продукта\nОписание продукта\nКатегорию продукта '
                    'из имеющихся\nНомер foadmap (1-low,2-medium,3-hi)\nФото '
                    'продукта\nСейчас работает только добавление фото, я жду название '
                    'продукта существующего в базе для добавления или замены его '
                    'картинки',
    '':'',
}